<a href="https://colab.research.google.com/github/Zubs/30daysofml/blob/master/QuickCode.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
url = 'https://raw.githubusercontent.com/Zubs/30daysofml/master/datasets_137031_324803_tips.csv'

data = pd.read_csv(url)

In [ ]:
data.head()

   total_bill   tip     sex smoker  day    time  size  id
0       16.99  1.01  Female     No  Sun  Dinner     2   1
1       10.34  1.66    Male     No  Sun  Dinner     3   2
2       21.01  3.50    Male     No  Sun  Dinner     3   3
3       23.68  3.31    Male     No  Sun  Dinner     2   4
4       24.59  3.61  Female     No  Sun  Dinner     4   5

In [ ]:
data['id'] = 1

In [ ]:
for i in range(len(data)):
  data['id'][i] = i + 1

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [ ]:
ids = data['id']
tips = data['tip']
data = data.drop(columns = ['id', 'tip'])

#.head()

In [ ]:
sample = pd.concat(objs = [ids, data, tips], axis = 1)

sample.head()

   id  total_bill     sex smoker  day    time  size   tip
0   1       16.99  Female     No  Sun  Dinner     2  1.01
1   2       10.34    Male     No  Sun  Dinner     3  1.66
2   3       21.01    Male     No  Sun  Dinner     3  3.50
3   4       23.68    Male     No  Sun  Dinner     2  3.31
4   5       24.59  Female     No  Sun  Dinner     4  3.61

In [ ]:
data.head()

   total_bill     sex smoker  day    time  size
0       16.99  Female     No  Sun  Dinner     2
1       10.34    Male     No  Sun  Dinner     3
2       21.01    Male     No  Sun  Dinner     3
3       23.68    Male     No  Sun  Dinner     2
4       24.59  Female     No  Sun  Dinner     4

In [ ]:
sample.to_csv('data.csv')

In [ ]:
sample_submission = pd.concat(objs = [sample['id'].head(25), sample['tip'].head(25)], axis = 1)

In [ ]:
sample_submission.to_csv('data_solutions.csv', index=False)

In [ ]:
test = pd.concat(objs = [sample['id'].head(25), sample['tip'].head(25)], axis = 1)

In [ ]:
import random
test['tip'] = random.randint(1, 5)

In [ ]:
test.to_csv('sample_subs.csv', index=False)

In [ ]:
test_data = pd.concat(objs = [ids, data], axis = 1).head(25)

test_data.head()

   id  total_bill     sex smoker  day    time  size
0   1       16.99  Female     No  Sun  Dinner     2
1   2       10.34    Male     No  Sun  Dinner     3
2   3       21.01    Male     No  Sun  Dinner     3
3   4       23.68    Male     No  Sun  Dinner     2
4   5       24.59  Female     No  Sun  Dinner     4

In [ ]:
test_data.to_csv('test_data.csv', index=False)